gitHubLink=https://github.com/StEx2022-23/sql2regex
converterName=SQL zu RegEx - Konverter
lang.change=Sprache \u00E4ndern
lang.de=Deutsch
nav.converter=Konvertierer
nav.visualization =Visualisierung
nav.examples =Beispiele
nav.about=\u00DCber Uns
nav.sourceCode=Quelltext @Github
nav.didactics=Didaktik der Informatik @TUD
tooldescription=Ein Konverter zum \u00DCbersetzen von SQL-Anweisungen in regul\u00E4re Ausdr\u00FCcke. Der Zweck besteht darin, variable Sch\u00FClerergebnisse zu validieren anhand einer Musterl\u00F6sung in digitalen Pr\u00FCfungsszenarien.
conv.heading=Konverter
conv.convert=Konvertieren
conv.reset=Einstellungen zur\u00FCcksetzen
copytoclipboard=in die Zwischenablage
underConstruction=Diese Website <strong>befindet sich noch im Aufbau</strong>!
jsonExport=als .json Datei speichern
conv.dateDetected=<strong>Ein Datum wurde erkannt!</strong> <br/> Zur korrekten Verarbeitung muss dieses in ein Literal \u00FCberf\u00FChrt werden.
conv.DateValueParsing=Umwandeln?

footer.impressum=Impressum
footer.privacyPolicy=Datenschutz
footer.licensedUnder=lizenziert unter 

settingsform.sql.notEmpty=SQL darf nicht leer sein
settingsform.sqlInput.invalidSql=<strong>Achtung!</strong> Die Eingabe konnte gegen keine der Grammatiken von <code>ORACLE</code>, <code>MARIADB</code>, <code>MYSQL</code> or <code>SQLSERVER</code> validiert werden.
settingsform.sqlInput.heading=SQL-Eingabe
settingsform.sqlInput=Gebe hier dein SQL-Statement ein.
settingsform.spellings.heading=Optionen zur Rechtschreibung
settingsform.orders.heading=Optionen zur Reihenfolge
settingsform.dateAndTime.heading=Optionen f\u00FCr Datum und Zeit
settingsform.aggregateFunctionLang.heading=Optionen f\u00FCr Sprache der Aggregatfunktionen
settingsform.datatype.heading=Optionen f\u00FCr Datentyp Synonyme
settingsform.otherSynonyms.heading=Optionen f\u00FCr andere Synonyme

settingsform.synonymsFor=Synonyme f\u00FCr

settingsform.TABLENAMESPELLING=1 Rechtschreibfehler pro Tabellenname
settingsform.COLUMNNAMESPELLING=1 Rechtschreibfehler pro Spaltenname
settingsform.KEYWORDSPELLING=1 Rechtschreibfehler pro SQL Keyword

settingsform.COLUMNNAMEORDER=Spalten Reihenfolge vertauschbar
settingsform.TABLENAMEORDER=Tabellen Reihenfolge vertauschbar
settingsform.INSERTINTOVALUESORDER=Reihenfolge von VALUE-Listen vertauschbar
settingsform.GROUPBYELEMENTORDER=Ausdruck Reihenfolge in Group By vertauschbar

settingsform.regexOutput.heading=RegEx-Ausgabe
settingsform.regexOutput=Hier erscheint das generierte RegEx. Es wird automatisch in die Zwischenablage kopiert.
settingsform.visualization=Visualisierung

convertingHistory.heading=Konvertierungs-Historie
convertingHistory.info=Diese Daten werden <strong>nur lokal im Browser gespeichert</strong>.
convertingHistory.clear=lokalen Speicher leeren

faq.heading=H\u00E4ufig gestellte Fragen
faq.sql.heading=Was ist SQL?
faq.sql.text=SQL steht f\u00FCr <strong>S</strong>tructured <strong>Q</strong>uery <strong>L</strong>anguage. Sie unterteilt sich in die folgenden Unter-Sprachen: Data-Query-Language (DQL), Data Manipulation Language (DML), Data Definition Language (DDL) und Data Control Language (DCL). SQL ist die Basis f\u00FCr die Interaktion mit Datenbanken mithilfe von Datenbank-Management-Systemen.
faq.sql.documentation=Syntax f\u00FCr SQL Ausdr\u00FCcke
faq.regex.heading=Was ist RegEx?
faq.regex.text=RegEx steht f\u00FCr <strong>Re</strong>gular <strong>Ex</strong>pressions (Regul\u00E4re Ausdr\u00FCcke). Sie erlauben eine Menge von Regeln f\u00FCr Zeichenketten festzulegen. Man benutzt regul\u00E4re Ausdr\u00FCcke oft, wenn auch unbewusst, z.B. bei "Suchen und Ersetzen".
faq.regex.documentation=RegEx-Dokumentation
faq.sqlAndRegex.heading=SQL & RegEx?
faq.sqlAndRegex.text=Kompetenzorientiertes e-Assesment und die zugeh\u00F6rigen digitalen Tests machen es notwendig Freitexteingaben anhand einer Musterl\u00F6sung zu \u00FCberpr\u00FCfen. In der Praxis k\u00F6nnen Antworten sich von dieser Musterl\u00F6sung unterscheiden, obwohl sie trotzdem korrekt sind. Mit den erstellen regul\u00E4ren Ausdr\u00FCcken auf Basis einer einzigen Musterl\u00F6sung k\u00F6nnen verschiedenste Antwortm\u00F6glichkeiten abgedeckt werden.
faq.sqlAndRegex.documention=ONYX-Dokumentation

visualization.heading1 = Visualisierung
visualization.heading2 = Erweiterte Visualisierung
visualization.externalResource = externe Ressource

cookies.text = Die Website setzt ein Session-Cookie. Dieses ist technisch notwendig, um mehrere Anfragen auf der Website h\u00E4ndeln zu k\u00F6nnen. Session-Cookies haben ein Timeout und werden definitiv nach Schlie\u00DFen des Browser wieder gel\u00F6scht. Dabei werden keine pers\u00F6nlichen Informationen gespeichert.
cookies.head = \uD83C\uDF6A Diese Website nutzt Cookies! \uD83C\uDF6A
cookies.learnMore = Mehr erfahren!
cookies.thanks = Danke f\u00FCr die Information!

examples.h1 =Beispielkonvertierungen
examples.example =Beispiel
examples.sqlStatemenmt =SQL-Ausdruck
examples.regEx=Regul\u00E4rer Ausdruck
examples.tryIt=Probier es aus!
examples.checkAgainstAlternative=F\u00FCge eine von dir gew\u00E4hlte Alternative ein:
examples.preset=oder w\u00E4hle eine Voreinstellung:
examples.noPreset=Keine Voreinstellung gew\u00E4hlt
examples.perfect=Perfekt!
examples.matches=Dieser SQL Ausdruck passt zum regul\u00E4ren Ausdruck!
examples.oops=Oooooops!
examples.doesntMatch=Dieser SQL Ausdruck passt nicht zum regul\u00E4ren Ausdruck!
examples.insertAStatement=Bitte trage ein SQL-Statement ein oder w\u00E4hle eine Voreinstellung aus!
examples.checkAgainstRegex=Pr\u00FCfe gegen regul\u00E4ren Ausdruck

aboutUs.courseOfStudies=Lehramt f\u00FCr Gymnasien (Physik, Informatik), 10. Semester
aboutUs.tuDresden=Technische Universit\u00E4t Dresden
aboutUs.contact=Kontakt

privacy.heading1=Datenschutzrichtlinie
privacy.preambel= Ihre Privatsph\u00E4re ist uns wichtig. Es geh\u00F6rt zu den Grunds\u00E4tzen von sqltoregex, Ihre Privatsph\u00E4re zu respektieren und alle geltenden Gesetze und Vorschriften in Bezug auf personenbezogene Daten einzuhalten, die wir \u00FCber Sie sammeln, auch \u00FCber unsere Website, https://sqltoregex.herokuapp.com, und andere Websites, die wir besitzen und betreiben. Diese Richtlinie ist seit dem 13. M\u00E4rz 2022 g\u00FCltig und wurde zuletzt am 13. M\u00E4rz 2022 aktualisiert.
privacy.informationWeCollectHeading=Informationen, die wir sammeln
privacy.informationWeCollectText=Informationen, die wir sammeln, umfassen sowohl Informationen, die Sie uns wissentlich und aktiv zur Verf\u00FCgung stellen, wenn Sie eine unserer Dienstleistungen und Werbeaktionen nutzen oder daran teilnehmen, als auch Informationen, die automatisch von Ihren Ger\u00E4ten im Zuge des Zugriffs auf unsere Produkte und Dienstleistungen gesendet werden.
privacy.logDataHeading=Protokolldaten
privacy.logDataText=Wenn Sie unsere Website besuchen, k\u00F6nnen unsere Server automatisch die von Ihrem Webbrowser bereitgestellten Standarddaten protokollieren. Dazu geh\u00F6ren die IP-Adresse Ihres Ger\u00E4ts, der Typ und die Version Ihres Browsers, die von Ihnen besuchten Seiten, die Uhrzeit und das Datum Ihres Besuchs, die auf jeder Seite verbrachte Zeit, andere Details \u00FCber Ihren Besuch sowie technische Details, die in Verbindung mit etwaigen Fehlern auftreten. Bitte beachten Sie, dass diese Informationen zwar f\u00FCr sich genommen nicht pers\u00F6nlich identifizierend sind, dass es aber m\u00F6glich sein kann, sie mit anderen Daten zu kombinieren, um einzelne Personen zu identifizieren.
privacy.collectionAndUseHeading=Erfassung und Verwendung von Informationen
privacy.collectionAndUseText=Wir k\u00F6nnen personenbezogene Daten von Ihnen erheben, wenn Sie eine der folgenden Aktionen auf unserer Website durchf\u00FChren: <ul><li>Verwenden Sie ein mobiles Ger\u00E4t oder einen Webbrowser, um auf unsere Inhalte zuzugreifen</li><li>Kontaktieren Sie uns per E-Mail, \u00FCber soziale Medien oder \u00FCber \u00E4hnliche Technologien</li><li>Wenn Sie uns in den sozialen Medien erw\u00E4hnen</li></ul>Wir sind berechtigt, Daten f\u00FCr die folgenden Zwecke zu erheben, zu speichern, zu verwenden und offenzulegen, wobei personenbezogene Daten nicht in einer Weise weiterverarbeitet werden, die mit diesen Zwecken unvereinbar ist: Bitte beachten Sie, dass wir Informationen, die wir \u00FCber Sie sammeln, mit allgemeinen Informationen oder Forschungsdaten kombinieren k\u00F6nnen, die wir von anderen vertrauensw\u00FCrdigen Quellen erhalten.
privacy.securityOfPersonalInformationHeading=Sicherheit Ihrer pers\u00F6nlichen Daten
privacy.securityOfPersonalInformationText=Wenn wir personenbezogene Daten erheben und verarbeiten und solange wir diese Daten aufbewahren, werden wir sie mit wirtschaftlich vertretbaren Mitteln sch\u00FCtzen, um Verlust und Diebstahl sowie unbefugten Zugriff, Offenlegung, Kopieren, Verwendung oder \u00C4nderung zu verhindern.Obwohl wir unser Bestes tun, um die personenbezogenen Daten, die Sie uns zur Verf\u00FCgung stellen, zu sch\u00FCtzen, weisen wir darauf hin, dass keine elektronische \u00DCbertragungs- oder Speichermethode zu 100 % sicher ist und niemand absolute Datensicherheit garantieren kann. Wir werden die auf uns anwendbaren Gesetze in Bezug auf jede Datenverletzung einhalten. Sie sind f\u00FCr die Wahl Ihres Passworts und dessen allgemeine Sicherheit verantwortlich und gew\u00E4hrleisten die Sicherheit Ihrer eigenen Daten im Rahmen unserer Dienste.
privacy.howLongToKeepHeading=Wie lange wir Ihre pers\u00F6nlichen Informationen aufbewahren
privacy.howLongToKeepText=Wir bewahren Ihre pers\u00F6nlichen Daten nur so lange auf, wie wir sie ben\u00F6tigen. Dieser Zeitraum h\u00E4ngt davon ab, wof\u00FCr wir Ihre Daten in \u00DCbereinstimmung mit dieser Datenschutzrichtlinie verwenden. Wenn Ihre personenbezogenen Daten nicht mehr ben\u00F6tigt werden, l\u00F6schen wir sie oder anonymisieren sie, indem wir alle Details entfernen, die Sie identifizieren. Falls erforderlich, k\u00F6nnen wir Ihre personenbezogenen Daten jedoch aufbewahren, um gesetzlichen, buchhalterischen oder berichtspflichtigen Verpflichtungen nachzukommen oder um sie f\u00FCr Archivierungszwecke im \u00F6ffentlichen Interesse, wissenschaftliche oder historische Forschungszwecke oder statistische Zwecke zu verwenden.
privacy.childrensPrivcacyHeading=Datenschutz f\u00FCr Kinder
privacy.childrensPrivcacyText=Unsere Produkte und Dienstleistungen richten sich nicht direkt an Kinder unter 13 Jahren, und wir erfassen nicht wissentlich pers\u00F6nliche Daten von Kindern unter 13 Jahren. 
privacy.internationalTransfersHeading=Internationale \u00DCbermittlung von pers\u00F6nlichen Daten
privacy.internationalTransfersText=Die von uns erfassten personenbezogenen Daten werden dort gespeichert und/oder verarbeitet, wo wir oder unsere Partner, verbundenen Unternehmen und Drittanbieter Einrichtungen unterhalten. Bitte beachten Sie, dass die Orte, an denen wir Ihre personenbezogenen Daten speichern, verarbeiten oder \u00FCbertragen, m\u00F6glicherweise nicht denselben Datenschutzgesetzen unterliegen wie das Land, in dem Sie die Daten urspr\u00FCnglich bereitgestellt haben. Wenn wir Ihre personenbezogenen Daten an Dritte in anderen L\u00E4ndern weitergeben: (i) f\u00FChren wir diese \u00DCbertragungen gem\u00E4\u00DF den Anforderungen des geltenden Rechts durch; und (ii) sch\u00FCtzen wir die \u00FCbertragenen personenbezogenen Daten gem\u00E4\u00DF dieser Datenschutzrichtlinie. 
privacy.yourRightsHeading=Ihre Rechte und die Kontrolle Ihrer pers\u00F6nlichen Daten
privacy.yourRightsText=Sie haben jederzeit das Recht, uns personenbezogene Daten vorzuenthalten, wobei Sie sich bewusst sind, dass Ihre Erfahrungen mit unserer Website dadurch beeintr\u00E4chtigt werden k\u00F6nnen. Wir werden Sie nicht diskriminieren, wenn Sie eines Ihrer Rechte in Bezug auf Ihre personenbezogenen Daten wahrnehmen. Wenn Sie uns personenbezogene Daten zur Verf\u00FCgung stellen, erkl\u00E4ren Sie sich damit einverstanden, dass wir diese in \u00DCbereinstimmung mit dieser Datenschutzrichtlinie sammeln, aufbewahren, verwenden und weitergeben. Sie haben das Recht, Einzelheiten zu den von uns gespeicherten personenbezogenen Daten anzufordern. Wenn wir personenbezogene Daten \u00FCber Sie von einem Dritten erhalten, werden wir diese gem\u00E4\u00DF dieser Datenschutzrichtlinie sch\u00FCtzen. Wenn Sie ein Dritter sind, der uns personenbezogene Daten \u00FCber eine andere Person zur Verf\u00FCgung stellt, sichern Sie zu, dass Sie die Zustimmung dieser Person haben, uns die personenbezogenen Daten zur Verf\u00FCgung zu stellen. Wenn Sie zuvor zugestimmt haben, dass wir Ihre personenbezogenen Daten f\u00FCr Direktmarketingzwecke verwenden, k\u00F6nnen Sie Ihre Meinung jederzeit \u00E4ndern. Wir bieten Ihnen die M\u00F6glichkeit, sich von unserer E-Mail-Datenbank abzumelden oder aus der Kommunikation auszusteigen. Bitte beachten Sie, dass wir unter Umst\u00E4nden bestimmte Informationen von Ihnen anfordern m\u00FCssen, um Ihre Identit\u00E4t zu best\u00E4tigen. Wenn Sie der Meinung sind, dass Informationen, die wir \u00FCber Sie gespeichert haben, ungenau, veraltet, unvollst\u00E4ndig, irrelevant oder irref\u00FChrend sind, wenden Sie sich bitte an uns, indem Sie die in dieser Datenschutzrichtlinie angegebenen Details verwenden. Wir werden angemessene Schritte unternehmen, um alle Informationen zu korrigieren, die sich als ungenau, unvollst\u00E4ndig, irref\u00FChrend oder veraltet erweisen. Wenn Sie der Meinung sind, dass wir gegen ein einschl\u00E4giges Datenschutzgesetz versto\u00DFen haben und eine Beschwerde einreichen m\u00F6chten, wenden Sie sich bitte unter Verwendung der nachstehenden Angaben an uns und teilen Sie uns alle Einzelheiten zu dem angeblichen Versto\u00DF mit. Wir werden Ihre Beschwerde umgehend untersuchen und Ihnen schriftlich antworten, wobei wir Ihnen das Ergebnis unserer Untersuchung und die Schritte mitteilen werden, die wir unternehmen werden, um Ihre Beschwerde zu bearbeiten. Sie haben auch das Recht, sich im Zusammenhang mit Ihrer Beschwerde an eine Aufsichtsbeh\u00F6rde oder eine Datenschutzbeh\u00F6rde zu wenden.
privacy.limitsHeading=Die Grenzen unserer Richtlinie
privacy.limitsText=Unsere Website kann Links zu externen Websites enthalten, die nicht von uns betrieben werden. Bitte beachten Sie, dass wir keine Kontrolle \u00FCber den Inhalt und die Richtlinien dieser Seiten haben und keine Verantwortung oder Haftung f\u00FCr deren Datenschutzpraktiken \u00FCbernehmen k\u00F6nnen. 
privacy.changesHeading=\u00C4nderungen dieser Richtlinie
privacy.changesText=Es liegt in unserem Ermessen, unsere Datenschutzrichtlinie zu \u00E4ndern, um Aktualisierungen unserer Gesch\u00E4ftsprozesse, aktuelle akzeptable Praktiken oder gesetzliche oder beh\u00F6rdliche \u00C4nderungen zu ber\u00FCcksichtigen. Wenn wir uns entscheiden, diese Datenschutzrichtlinie zu \u00E4ndern, werden wir die \u00C4nderungen hier unter demselben Link ver\u00F6ffentlichen, \u00FCber den Sie auf diese Datenschutzrichtlinie zugreifen. Falls gesetzlich vorgeschrieben, werden wir Ihre Zustimmung einholen oder Ihnen die M\u00F6glichkeit geben, sich f\u00FCr oder gegen eine neue Verwendung Ihrer personenbezogenen Daten zu entscheiden, je nachdem, was zutrifft.
privacy.contactHeading=Kontakt
privacy.contactText=Wenn Sie Fragen oder Bedenken in Bezug auf Ihre Privatsph\u00E4re haben, k\u00F6nnen Sie uns unter den folgenden Kontaktdaten kontaktieren: <br> Patrick Binkert<br/>contact@binkert-patrick.de

impressum.heading=Impressum
impressum.informationTMGHeading=Informationen gem\u00E4\u00DF to \u00A7 5 TMG
impressum.informationTMGtext=Patrick Binkert <br/> Maximilian F\u00F6rster
impressum.contactHeading=Kotakt
impressum.contactText=E-Mail: contact@binkert-patrick.de<br/><br/>GitHub: https://github.com//alletkla<br/>GitHub: https://github.com//binkertpat
impressum.disclaimerHeading=Haftungsausschluss
impressum.liablityHeading=Haftung f\u00FCr Inhalte
impressum.liablityText=Alle Inhalte unserer Website wurden mit gr\u00F6\u00DFtm\u00F6glicher Sorgfalt und nach bestem Wissen erstellt. F\u00FCr die Richtigkeit, Vollst\u00E4ndigkeit und Aktualit\u00E4t der Inhalte k\u00F6nnen wir jedoch keine Gew\u00E4hr \u00FCbernehmen. Als Diensteanbieter sind wir gem\u00E4\u00DF \u00A7 7 Abs.1 TMG f\u00FCr eigene Inhalte auf diesen Seiten nach den allgemeinen Gesetzen verantwortlich. Nach \u00A7\u00A7 8 bis 10 TMG sind wir als Diensteanbieter jedoch nicht verpflichtet, \u00FCbermittelte oder gespeicherte fremde Informationen zu \u00FCberwachen oder nach Umst\u00E4nden zu forschen, die auf eine rechtswidrige T\u00E4tigkeit hinweisen. Verpflichtungen zur Entfernung oder Sperrung der Nutzung von Informationen nach den allgemeinen Gesetzen bleiben hiervon unber\u00FChrt. Eine diesbez\u00FCgliche Haftung ist jedoch erst ab dem Zeitpunkt der Kenntnis einer konkreten Rechtsverletzung m\u00F6glich. Bei Bekanntwerden von entsprechenden Rechtsverletzungen werden wir diese Inhalte umgehend entfernen.
impressum.limitationHeading=Haftungsbeschr\u00E4nkung f\u00FCr externe Links
impressum.limitationText=Unsere Website enth\u00E4lt Links zu externen Websites Dritter. Auf den Inhalt dieser direkt oder indirekt verlinkten Websites haben wir keinen Einfluss. Deshalb k\u00F6nnen wir f\u00FCr die Inhalte der "externen Links" auch keine Gew\u00E4hr \u00FCbernehmen. F\u00FCr die Inhalte der externen Links ist stets der jeweilige Anbieter oder Betreiber der Seiten (Autor) verantwortlich. Die externen Links wurden zum Zeitpunkt der Verlinkung auf m\u00F6gliche Rechtsverst\u00F6\u00DFe \u00FCberpr\u00FCft und waren zum Zeitpunkt der Verlinkung frei von illegalen Inhalten. Eine st\u00E4ndige Kontrolle der Inhalte der externen Links ist f\u00FCr den Anbieter ohne konkrete Hinweise auf Rechtsverst\u00F6\u00DFe nicht zumutbar. Bei direkten oder indirekten Verweisen auf fremde Internetseiten ("Links"), die au\u00DFerhalb unseres Verantwortungsbereiches liegen, w\u00FCrde eine Haftungsverpflichtung ausschlie\u00DFlich in dem Fall in Kraft treten, in dem wir von den Inhalten Kenntnis haben und es uns technisch m\u00F6glich und zumutbar w\u00E4re, die Nutzung im Falle rechtswidriger Inhalte zu verhindern. Diese Feststellung gilt f\u00FCr alle innerhalb des eigenen Internetangebotes gesetzten Links und Verweise sowie f\u00FCr Fremdeintr\u00E4ge in von uns eingerichteten G\u00E4steb\u00FCchern, Diskussionsforen und Blogs. F\u00FCr illegale, fehlerhafte oder unvollst\u00E4ndige Inhalte und insbesondere f\u00FCr Sch\u00E4den, die aus der Nutzung oder Nichtnutzung solcherart dargebotener Informationen entstehen, haftet allein der Anbieter der Seite, auf welche verwiesen wurde, insbesondere derjenige, der \u00FCber Links auf die jeweilige Ver\u00F6ffentlichung lediglich verweist. Bei Kenntnisnahme von Rechtsverst\u00F6\u00DFen werden wir die externen Links unverz\u00FCglich entfernen.
impressum.copyrightHeading=Urheberrecht
impressum.copyrightText=Die auf unserer Website ver\u00F6ffentlichten Inhalte und Werke unterliegen dem deutschen Urheberrecht (http://www.gesetze-im-internet.de/bundesrecht/urhg/gesamt.pdf) . Die Vervielf\u00E4ltigung, Bearbeitung, Verbreitung und jede Art der Verwertung au\u00DFerhalb der Grenzen des Urheberrechtes bed\u00FCrfen der schriftlichen Zustimmung des jeweiligen Autors bzw. Erstellers im Sinne des Urheberrechtes (http://www.gesetze-im-internet.de/bundesrecht/urhg/gesamt.pdf ). Downloads und Kopien dieser Seite sind nur f\u00FCr den privaten, nicht kommerziellen Gebrauch gestattet. Soweit die Inhalte auf unserer Seite nicht von uns erstellt wurden, werden die Urheberrechte Dritter beachtet. Insbesondere werden Inhalte Dritter als solche gekennzeichnet. Sollten Sie trotzdem auf eine Urheberrechtsverletzung aufmerksam werden, bitten wir um einen entsprechenden Hinweis. Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Inhalte umgehend entfernen.
